<title>Sierra Club</title> <table width="100%" border="0">
<tr>
<td align="left" valign="top" width="259" height="59"><font size="2" face="Arial, Helvetica, sans-serif"><strong>FOR IMMEDIATE RELEASE: </strong>   
<br>
AUGUST 8, 2005  
<br>
10:28 AM<br>
</font></td>
<td align="left" valign="top" width="399" height="59"><p><font size="2" face="Arial, Helvetica, sans-serif"><b>CONTACT: <a href="http://www.sierraclub.org" target="_new">Sierra Club</a>   
</b><br>
Gerardo Moncada, <a href="http://www.greenpeace.org" target="_new">Greenpeace</a> 5530 2165 ext. 112 and 220<br>
Laura Salas, <a href="http://www.tlachinollan.org" target="_new">Tlachinollan</a> 04455 1341 9849 cell, (01) (757) 4761220 office<br>
Megan Lewis, Sierra Club 202.548.6587<br>
</font><FONT face="Times New Roman" 
size=2><SPAN 
style="FONT-SIZE: 10pt"><o:p></o:p></SPAN></FONT></p>
</td>
</tr>
<tr>
<td colspan="2">&nbsp;</td>
</tr>
<tr>
<td height="49" colspan="2"><center>
<center>
<P class=MsoBodyText style="MARGIN-RIGHT: 0in; TEXT-ALIGN: center" 
align=center><font size="4" face="Arial, Helvetica, sans-serif"><o:p><strong>Sierra Club Presents the Chico Mendes Award to Forest Defender, Unfairly Imprisoned</strong></o:p></font></P>
</center>

</center>
</td>
</tr>
<tr>
<td colspan="2">&nbsp;</td>
</tr>
<tr>
<td colspan="2"><p><font size="2" face="Arial, Helvetica, sans-serif">MEXICO CITY- August 8  - Felipe Arreaga S&aacute;nchez, Celsa Valdovinos and Albertano
Pe&ntilde;aloza Dom&iacute;nguez have been tireless environmental advocates for more
than ten years. Now Felipe is unjustly imprisoned simply for defending
Guerrero's forests. The Sierra Club together with Greenpeace, Amnesty
International and the Center for Human Rights of the Mountain,
Tlachinollan, will hold a ceremony recognizing the three activists'
courageous work. The Sierra Club will honor them with their prestigious
Chico Mendes Award.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> WHAT: The presentation of the Chico Mendes Award to Felipe Arreaga
S&aacute;nchez, Celsa Valdovinos and Albertano Pe&ntilde;aloza Dom&iacute;nguez</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> WHEN: Tuesday, August 9 at 11:00 a.m.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> WHERE: Casa Universitaria del Libro, Calle de Orizaba #24, Col. Roma</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> WHO: <br>
Celsa Valdovinos, Environmental Activist and wife of Felipe
Arreaga <br>
S&aacute;nchez
Alejandro Queral, International Policy Advisor, Sierra Club
<br>
Mario Patr&oacute;n, Lawyer, Center for Human Rights of the
Mountain, Tlachinollan
<br>
Susan Lee, Director of Programs, the Americas, Amnesty
International
<br>
Alejandro Calvillo, Director, Greenpeace M&eacute;xico</font></p>
<p>###</p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> Sierra Club otorga el premio Chico Mendes a campesinos ecologistas,<br>
encarcelados injustamente</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> M&eacute;xico D.F. - Felipe Arreaga S&aacute;nchez, Celsa Valdovinos y Albertano<br>
Pe&ntilde;aloza Dom&iacute;nguez han sido defensores incansables de la protecci&oacute;n del<br>
medio ambiente por m&aacute;s de diez a&ntilde;os. Felipe y Albertano est&aacute;n ahora<br>
encarcelados injustamente por el &uacute;nico crimen de defender los bosques del<br>
estado de Guerrero. El Sierra Club, junto con Greenpeace, Amnistia<br>
Internacional y el Centro de Derechos Humanos de la Monta&ntilde;a,<br>
Tlachinollan, llevar&aacute;n a cabo una ceremonia en la cual reconocer&aacute;n el<br>
trabajo valiente y comprometido de los tres, y les entregar&aacute;n el<br>
prestigioso premio Chico Mendes del Sierra Club.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> QUE: El otorgamiento del premio Chico Mendes a Felipe Arreaga<br>
S&aacute;nchez, Celsa Valdovinos y Albertano Pe&ntilde;aloza Dom&iacute;nguez</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> CUANDO: Martes, 9 de agosto, a las 11:00 de la ma&ntilde;ana</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> DONDE: Las instalaciones de la Casa Universitaria del Libro, Calle<br>
de Orizaba #24, Col. Roma</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> QUIEN: Celsa Valdovinos, Activista Medioambiental y esposa de Felipe<br>
Arreaga S&aacute;nchez<br>
Alejandro Queral, Asesor de Pol&iacute;tica Internacional del Sierra<br>
Club<br>
Susan Lee, Directora de los Programas de las Am&eacute;ricas,<br>
Amnesty International<br>
Mario Patr&oacute;n, Abogado del Centro de Derechos Humanos de la<br>
Monta&ntilde;a, Tlachinollan<br>
Alejandro Calvillo, Director de Greenpeace M&eacute;xico<br>
</font></p>
<div align="CENTER"><font face="Arial, Helvetica, sans-serif" size="2">###</font></div></td>
</tr>
</table>
