<!-- #BeginTemplate "/Templates/new news.dwt" -->
<head>
<!-- #BeginEditable "doctitle" -->
<TITLE>Sierra Club </TITLE>
<!-- #EndEditable -->
</head>

<table width="100%" border="0">
<tr>
<!-- #BeginEditable "Contact" -->        
<td align="left" valign="top" width="200"><font size="2"><strong><font face="Arial, Helvetica, sans-serif">FOR IMMEDIATE RELEASE 
</font></strong><font face="Arial, Helvetica, sans-serif">AUGUST 9, 2005 
<br>
12:33 PM 
</font></font></td>
<td align="left" valign="top" width="330"><p><font size="2"><b><font face="Arial, Helvetica, sans-serif">CONTACT: </font></b> <font face="Arial, Helvetica, sans-serif"><b><a href="http://www.sierraclub.org" target="_new">Sierra Club</a> 
</b> <br>
Mexico: 
Alejandro Queral - 044 55 27 25 24 26 
<br>
United States: 
Stephen Mills - 202-675-6691 
</font></font></p>
</td>
<!-- #EndEditable -->
</tr>
<tr>
<td colspan="2">&nbsp;</td></tr>

<tr>
<td colspan="2">
<font size="4" face="Arial, Helvetica, sans-serif"><b>
<!-- #BeginEditable "Header" -->
<div align="center">Sierra Club Honors Mexican Forest Defenders with Chico Mendes Award</div>
<!-- #EndEditable -->
</b></font>
</td>
</tr>
<tr>
<td colspan="2">&nbsp;</td></tr>
<tr>
<td colspan="2">
<!-- #BeginEditable "Body" -->
<p><font size="2" face="Arial, Helvetica, sans-serif">MEXICO CITY  - August 9 - Today the Sierra Club presented its prestigious Chico 
Mendes Award to imprisoned environmentalist Felipe Arreaga Sanchez, his 
wife Celsa Valdovinos Rios and Albertano Pe&ntilde;aloza for their outstanding 
environmental heroism. The award recognizes the activists' courage and 
leadership in defending the forests of Mexico&rsquo;s Sierra de Petatl&aacute;n from 
illegal deforestation by multinational timber companies, powerful 
landowners and drug traffickers.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">&quot;Defending the environment for future generations is not a crime,&quot; said 
Alejandro Queral, International Policy Advisor for the Sierra Club. 
&quot;Environmentalists are sitting in jail while the individuals who have 
violated their human rights and broken Mexican environmental laws for 
personal profit remain free. In this dangerous climate it is imperative 
that elected officials pass and enforce strong laws protecting the civil 
liberties of environmentalists.&quot;</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">In November 2004, Felipe Arreaga was arrested on unsubstantiated charges 
of murder widely accepted to have been in retaliation for his leadership 
in protecting the forests of the Sierra de Petatl&aacute;n. He is currently 
being held in a Guerrero, Mexico prison. Arreaga is one of the founding 
members of the Organization of Farmer Environmentalists of the Sierra de 
Petatl&aacute;n y Coyuca de Catal&aacute;n (OCESP by its Spanish name), which 
organized community members to oppose the rampant - and often illegal - 
logging in the mountains of Sierra de Petatl&aacute;n.</font></font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Celsa Valdovinos, Arreaga&rsquo;s wife and founder of the Organization of 
Women Environmentalists of the Sierra de Petatl&aacute;n (OMESP) has continued 
her work for the environment despite threats to her personal safety. 
Under her leadership, OMESP has undertaken a successful reforestation 
campaign, developed a system of sustainable organic gardening for local 
families, and carried out education campaigns to prevent local air and 
water pollution.</font></font></p>
<p> <font size="2" face="Arial, Helvetica, sans-serif">&quot;Celsa is not only well-respected, but actually revered by the women of 
the Sierra de Petatl&aacute;n for her work and dedication to preserving the 
environment,&quot; said Stephen Mills, Director of the Sierra Club&rsquo;s 
International Program. &quot;This award recognizes the vital importance of 
her work and the risks she takes in a dangerous climate.&quot;</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> The third award recipient, Albertano Pe&ntilde;aloza, a timber company 
whistleblower and another founding leader of OCESP, was with his family 
when they were ambushed by thugs believed to be working for the local 
land boss Bernardino Bautista del Valle. Two of his sons, ages nine and 
twenty, were killed during the attack. Mr. Pe&ntilde;aloza and his other two 
sons were seriously wounded.</font></p>
<p> <font size="2" face="Arial, Helvetica, sans-serif">&quot;The Pe&ntilde;aloza family's tragedy is an ugly example of the dangerous 
nature of protecting the environment in Mexico,&quot; said Queral. &quot;The long 
history of attacks against environmentalists by local land owners in 
this part of Guerrero makes clear the need for legal protections of 
activists&rsquo; civil and political rights.&quot; The Sierra Club is urging the 
administration of President Vicente Fox to champion such legal 
protections at the federal level.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> Felipe Arreaga&rsquo;s and Albertano Pe&ntilde;aloza&rsquo;s case is not the first time 
environmentalists have been incarcerated for defending local forests. 
On May 2, 1999, Rodolfo Montiel and Teodoro Cabrera - both members of 
the OCESP - were arrested by a battalion of the Mexican Army, who beat 
them, threatened them at gunpoint, and tortured them, resulting in a 
forced confession to trumped-up charges of drug trafficking and illegal 
possession of weapons. The Sierra Club and Amnesty International 
believe that these charges were created to imprison Montiel and Cabrera 
for their environmental activism. Under international and domestic 
pressure, President Fox pardoned them in November 2001 for humanitarian 
reasons.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> In 2004, Arreaga was wrongfully imprisoned based on a fabricated 
investigation surrounding a 1998 murder, despite the fact that Arreaga 
is documented to have been out of town when the crime occurred. 
Arreaga&rsquo;s attorneys expect a decision by the presiding judge in the next 
two days. Felipe and Celsa have been chosen as runners-up for this 
year's Conde Nast Traveler Environmental Award.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> The Sierra Club established the Chico Mendes Award, named after the late 
Brazilian rubber tapper and environmentalist, in 1989 to recognize 
individuals or non-governmental organizations outside of the United 
States who have exhibited extraordinary courage and leadership at the 
grassroots level in the struggle to protect the environment. Previous 
recipients include Rodolfo Montiel (Mexico), the Movement for the 
Survival of the Ogoni People (Nigeria), and Aleksandr Nikitin (Russia).</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> The award to Felipe Arreaga Sanchez reads: Sierra Club 
2005 Chico Mendes Award for global environmental heroism is presented to 
Felipe Arreaga Sanchez 
Organizaci&oacute;n Campesina Ecologista de la Sierra Petatl&aacute;n y Coyuca de 
Catal&aacute;n 
for extraordinary courage and leadership in defense of the forests of 
Guerrero, Mexico. 
</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> Sierra Club 
Premio Chico Mendes 2005 por la hero&iacute;ca protecci&oacute;n al medio ambiente global e </font><font size="2" face="Arial, Helvetica, sans-serif">s presentado a 
Felipe Arreaga Sanchez 
Organizaci&oacute;n Campesina Ecologista de la Sierra Petatl&aacute;n y Coyuca de 
Catal&aacute;n 
Por el valor extraordinario y el liderazgo en defensa de los bosques de 
Guerrero, Mexico</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> To see photos of Felipe, Celsa and Albertano, visit 
http://www.tlachinollan.org/videos_galeria/galeria/gallery/albums.php 
</font></p>
<p>&nbsp;</p>
<p><font size="2" face="Arial, Helvetica, sans-serif">PARA DISTRIBUCION INMEDIATA: CONTACTO: 
Martes, 9 de Agosto de 2005 En M&eacute;xico: Alejandro<br>
Queral: 044 55 27 25 24 26<br>
En EE.UU.: Stephen Mills, 202-675-6691<br>
</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif"> El Sierra Club Galardona a Defensores de los Bosques con<br>
el Premio Chico Mendes</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">MEXICO, D.F. - El Sierra Club entreg&oacute; hoy su prestigioso Premio Chico Mendes a los medioambientalistas Felipe Arreaga S&aacute;nchez, quien se encuentra en prisi&oacute;n, a su esposa, Celsa Valdovinos R&iacute;os, y Albertano Pe&ntilde;aloza Dom&iacute;nguez por su extraordinario hero&iacute;smo ecol&oacute;gico. El galard&oacute;n premia su coraje y determinaci&oacute;n para defender los bosques de la Sierra de Petatl&aacute;n, en el estado de Guerrero, de la deforestaci&oacute;n causada por los terratenientes locales.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">&quot;Defender el medio ambiente para futuras generaciones no es un crimen&quot;, dijo Alejandro Queral, Asesor de Pol&iacute;tica Internacional del Sierra Club. &quot;Estos defensores del medio ambiente permanecen en prisi&oacute;n mientras que siguen libres los individuos que han violado sus derechos humanos y las leyes medioambientales mexicanas para enriquecerse. En medio de esta peligrosa atm&oacute;sfera es imperativo que los servidores p&uacute;blicos mexicanos aprueben y hagan obedecer leyes estrictas para proteger las libertades c&iacute;vicas de los medioambientalistas&quot;.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Felipe Arreaga fue arrestado bajo acusaciones falsas de asesinato en noviembre de 2004 en una m&aacute;s que aparente represalia por liderar la protecci&oacute;n de los bosques de la Sierra de Petatl&aacute;n. Actualmente se encuentra en la Prisi&oacute;n de Guerrero. Arreaga es uno de los miembros fundadores de la Organizaci&oacute;n de Campesinos Ecologistas de la Sierra de Petatl&aacute;n y Coyuca de Catal&aacute;n (OCESP), la cual organiz&oacute; a los campesinos para oponerse a las abusivas -y a menudo ilegales- explotaciones madereras en los bosques de esa zona.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Celsa Valdovinos, la esposa de Arreaga y fundadora de la Organizaci&oacute;n de Mujeres Ecologistas de la Sierra de Petatl&aacute;n (OMESP), ha continuado su labor en favor del medio ambiente pese a amenazas contra su seguridad personal. Bajo su liderazgo, OMESP ha realizado una exitosa campa&ntilde;a de reforestaci&oacute;n, ha desarrollado un sistema de huertas org&aacute;nicas sustentables para las familias de la zona y ha completado campa&ntilde;as de educaci&oacute;n para evitar la contaminaci&oacute;n del aire y el agua del &aacute;rea.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">&quot;Celsa no s&oacute;lo es muy respetada, sino que muy querida por las mujeres de la Sierra de Petatl&aacute;n debido a su trabajo y dedicaci&oacute;n por preservar el medio ambiente&quot;, dijo Stephen Mills, Director del Programa Internacional del Sierra Club. &quot;Este premio reconoce la importancia vital de su trabajo y los riesgos que corre al realizarlo&quot;.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Pe&ntilde;aloza -el tercer galardonado, miembro fundador de OCESP y delator de las compa&ntilde;&iacute;as madereras- se encontraba con su familia cuando fueron atacados por matones sospechosos de estar en la n&oacute;mina del cacique local Bernardino Bautista del Valle. Dos de los hijos de Pe&ntilde;aloza -uno de nueve a&ntilde;os y su hermano de 20- murieron en el ataque. Pe&ntilde;aloza y sus otros dos hijos resultaron gravemente heridos.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">&quot;La tragedia de la familia Pe&ntilde;aloza es un triste ejemplo de lo peligroso que es proteger el medio ambiente en M&eacute;xico&quot;, dijo Queral. &quot;La larga historia de los ataques de los terratenientes locales contra ecologistas en esta parte de Guerrero deja clara la necesidad de protecciones legales para los derechos civiles y pol&iacute;ticos de los activistas&quot;.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">El Sierra Club ha instado a la administraci&oacute;n del Presidente Vicente Fox a que tome la iniciativa en este sentido a nivel federal.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Esta no es la primera vez que ecologistas como Arreaga y Pe&ntilde;aloza son encarcelados por defender los bosques locales. El 2 de mayo de 1999, Rodolfo Montiel y Teodoro Cabrera -ambos miembros del OCESP- fueron arrestados por un batall&oacute;n del Ej&eacute;rcito Mexicano, quienes les dieron una golpiza, los amenazaron con sus armas y los torturaron para hacerles admitir acusaciones falsas de narcotr&aacute;fico y posesi&oacute;n ilegal de armas. El Sierra Club y Amnist&iacute;a Internacional creen que estas acusaciones se inventaron para encarcelar a Montiel y Cabrera debido a su activismo medioambiental. Bajo presi&oacute;n nacional e internacional, el Presidente Fox los perdon&oacute; en noviembre de 2001 por razones humanitarias.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Desde 2004 Arreaga ha estado injustamente encarcelado a resultas de una investigaci&oacute;n falsa que data de 1998 sobre un asesinato del cual Arreaga no pudo haber sido parte ya que estaba en otro lugar cuando se cometi&oacute; el crimen. Los abogados de Arreaga esperan que el juez del caso se pronuncie en los pr&oacute;ximos dos d&iacute;as. Arreaga y Valdovinos quedaron segundos en la selecci&oacute;n de los ganadores del Premio Medioambiental de Conde Nast Traveler.</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">El Sierra Club estableci&oacute; el Premio Chico Mendes en 1989 para galardonar a individuos u organizaciones no gubernamentales fuera de Estados Unidos que hayan demostrado un coraje y dotes de liderazgo extraordinarios en actividades de base de protecci&oacute;n del medio ambiente. Ganadores anteriores incluyen a Montiel, el Movimiento para la Supervivencia del Pueblo Ongoni<br>
(Nigeria) y Aleksandr Nikitin (Rusia).</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">El premio para Arreaga dice lo siguiente:</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Sierra Club<br>
Premio Chico Mendes de 2005<br>
por hero&iacute;smo medioambiental global</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Se otorga a<br>
Felipe Arreaga S&aacute;nchez<br>
Organizaci&oacute;n Campesina Ecologista de la Sierra Petatl&aacute;n y Coyuca de Catal&aacute;n Por su extraordinario coraje y dotes de liderazgo en defensa de los bosques de Guerrero, M&eacute;xico</font></p>
<p><font size="2" face="Arial, Helvetica, sans-serif">Para ver fotos de Felipe, Celsa y Albertano, visite http://www.tlachinollan.org/videos_galeria/galeria/gallery/albums.php</font></p>
<p align="center"><font size="2" face="Arial, Helvetica, sans-serif">###</font></p>
<!-- #EndEditable --> </td>
</tr>
</table>
<!-- #EndTemplate -->
